In [1]:
#dataframes

In [2]:
import pandas as pd

In [3]:
#datframes

In [5]:
roll = pd.Series([1,2,3,4,5])
name = pd.Series(['sania','akku','sanskruti','chaitanya','kavya'])
marks = pd.Series([76,32,54,66,22])

In [9]:
df=pd.DataFrame({
    'roll':roll,
    'name':name,
    'marks':marks
})

In [10]:
df

   roll       name  marks
0     1      sania     76
1     2       akku     32
2     3  sanskruti     54
3     4  chaitanya     66
4     5      kavya     22

In [11]:
#renaming

In [13]:
col={'roll':'id','marks':'grades'}
df.rename(columns=col)

   id       name  grades
0   1      sania      76
1   2       akku      32
2   3  sanskruti      54
3   4  chaitanya      66
4   5      kavya      22

In [14]:
ind={1:'one',4:'four'}
df.rename(index = ind)

      roll       name  marks
0        1      sania     76
one      2       akku     32
2        3  sanskruti     54
3        4  chaitanya     66
four     5      kavya     22

In [15]:
#iterate
for x in df:
     print(x)

roll
name
marks

In [16]:
#print all data

In [19]:
#sort by values

df.sort_values(by = 'marks')

   roll       name  marks
4     5      kavya     22
1     2       akku     32
2     3  sanskruti     54
3     4  chaitanya     66
0     1      sania     76

In [20]:
df.sort_values(by = 'marks',ascending = False)

   roll       name  marks
0     1      sania     76
3     4  chaitanya     66
2     3  sanskruti     54
1     2       akku     32
4     5      kavya     22

In [24]:
df['marks'].max()

76

In [25]:
#methods on string

In [26]:
df['name'].str.title()

0        Sania
1         Akku
2    Sanskruti
3    Chaitanya
4        Kavya
Name: name, dtype: object

In [28]:
df['name'].str.startswith('an')

0    False
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [29]:
df['name'].str.contains('n')

0     True
1    False
2     True
3     True
4    False
Name: name, dtype: bool

In [30]:
df['roll'] = df['roll'] + 100

In [31]:
df

   roll       name  marks
0   101      sania     76
1   102       akku     32
2   103  sanskruti     54
3   104  chaitanya     66
4   105      kavya     22

In [35]:
gender =['f','f','f','f','f']

In [36]:
df['gender'] = gender

In [37]:
df

   roll       name  marks gender
0   101      sania     76      f
1   102       akku     32      f
2   103  sanskruti     54      f
3   104  chaitanya     66      f
4   105      kavya     22      f

In [39]:
#add a new column called cgpa =>marks|10 + 0.5

In [40]:
df ['cgpa'] = df ['marks']/10 + 0.5

In [41]:
df

   roll       name  marks gender  cgpa
0   101      sania     76      f   8.1
1   102       akku     32      f   3.7
2   103  sanskruti     54      f   5.9
3   104  chaitanya     66      f   7.1
4   105      kavya     22      f   2.7

In [42]:
df['gender'].value_counts()

gender
f    5
Name: count, dtype: int64

In [44]:
df ['gender'].mode()

0    f
Name: gender, dtype: object

In [45]:
### group by

In [46]:
gr= df.groupby('gender')

In [47]:
gr.groups

{'f': [0, 1, 2, 3, 4]}

In [48]:
gr.get_group('f')

   roll       name  marks gender  cgpa
0   101      sania     76      f   8.1
1   102       akku     32      f   3.7
2   103  sanskruti     54      f   5.9
3   104  chaitanya     66      f   7.1
4   105      kavya     22      f   2.7

In [49]:
gr['marks'].mean()

gender
f    50.0
Name: marks, dtype: float64

In [50]:
#concate and merge

In [51]:
df

   roll       name  marks gender  cgpa
0   101      sania     76      f   8.1
1   102       akku     32      f   3.7
2   103  sanskruti     54      f   5.9
3   104  chaitanya     66      f   7.1
4   105      kavya     22      f   2.7

In [63]:
df.drop(['gender','cgpa'], axis = 1 , inplace = True)

In [64]:
# create a dataframe containing roll,gender,cgpa columns
#here roll column will be same as df

In [65]:
df

   roll       name  marks
0   101      sania     76
1   102       akku     32
2   103  sanskruti     54
3   104  chaitanya     66
4   105      kavya     22

cgpa df['marks']/10 + 0.5

In [71]:
dft = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})

In [68]:
df

   roll       name  marks
0   101      sania     76
1   102       akku     32
2   103  sanskruti     54
3   104  chaitanya     66
4   105      kavya     22

In [69]:
#merge

In [75]:
pd.concat([df,dft],ignore_index= True)

   roll       name  marks
0   101      sania     76
1   102       akku     32
2   103  sanskruti     54
3   104  chaitanya     66
4   105      kavya     22
5     1      sania     76
6     2       akku     32
7     3  sanskruti     54
8     4  chaitanya     66
9     5      kavya     22

In [73]:
df ['marks'] > 60

0     True
1    False
2    False
3     True
4    False
Name: marks, dtype: bool

In [78]:
df[df['marks'] > 60]

   roll       name  marks
0   101      sania     76
3   104  chaitanya     66

In [79]:
classs = ['BE','TE','BE','TE','BE']
df['classs'] = classs

In [80]:
df

   roll       name  marks classs
0   101      sania     76     BE
1   102       akku     32     TE
2   103  sanskruti     54     BE
3   104  chaitanya     66     TE
4   105      kavya     22     BE

In [83]:
x=df[(df['marks'] > 60) & (df['classs'] == 'BE')]
x

   roll   name  marks classs
0   101  sania     76     BE

In [84]:
#export the dataset

In [85]:
x.to_csv('output.csv',index= False)

In [86]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [87]:
df.duplicated().sum()

0

In [88]:
df.drop_duplicates(inplace = True)

In [89]:
df

   roll       name  marks classs
0   101      sania     76     BE
1   102       akku     32     TE
2   103  sanskruti     54     BE
3   104  chaitanya     66     TE
4   105      kavya     22     BE

In [90]:
df.dropna()

   roll       name  marks classs
0   101      sania     76     BE
1   102       akku     32     TE
2   103  sanskruti     54     BE
3   104  chaitanya     66     TE
4   105      kavya     22     BE

In [91]:
df ['marks'].fillna(60)

0    76
1    32
2    54
3    66
4    22
Name: marks, dtype: int64

In [93]:
df ['marks'].fillna(df['marks'].mean())

0    76
1    32
2    54
3    66
4    22
Name: marks, dtype: int64

In [94]:
df.fillna(method = 'pad')

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_10868\2275225546.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'pad')

   roll       name  marks classs
0   101      sania     76     BE
1   102       akku     32     TE
2   103  sanskruti     54     BE
3   104  chaitanya     66     TE
4   105      kavya     22     BE